[
    {
        "imag": "https://logowik.com/content/uploads/images/fractal3250.jpg",
        "desig": "FULL STACK DEVELOPER, FRACTAL",
        "descr": "At Fractal, I designed and built scalable backend APIs using Django, integrating with external services like calendar apps with minimal latency. I integrated data science models into the backend, enabling real-time processing, and used Azure Redis for caching to drastically improve API responsiveness. For computationally intensive tasks, I implemented distributed worker queues, and utilized Azure Functions for lightweight, serverless processing. I also led the migration architecture towards FastAPI to enable fully asynchronous request handling. I optimized database access patterns and caching strategies, reducing infrastructure costs while increasing system performance. I maintained Swagger-based API documentation, wrote unit tests for robust Django apps, and contributed to frontend development for specific modules. Collaborated with cross-functional teams and mentored junior developers, ensuring high-quality, maintainable code through code reviews and design discussions.",
        "link": ""
    },      
    {
        "imag":"https://zenprospect-production.s3.amazonaws.com/uploads/pictures/64b5663bd8b34b0001a3146d/picture",
        "desig":"FULL STACK DEVELOPER, QI-CAP",
        "descr":"At QI-CAP, a leading High-Frequency Trading platform, I spearheaded the development of pivotal features, notably the Strategy Builder and Pay-off Charts, from inception to implementation. These enhancements empower traders to craft bespoke strategies, offering predictive insights into potential gains or losses. Leveraging the robust Chart.js visualization library, I ensured seamless generation of dynamic graphs. Beyond this, I championed a solo effort in architecting and building the Employee-Company Portal, a comprehensive system conceived from the ground up. This encompassing solution boasts a myriad of functionalities, which I'm eager to elaborate on during interviews.",
        "link":""
    },
    {
        "imag":"https://www.analyticsinsight.net/wp-content/uploads/2019/08/Infosys.jpg",
        "desig":"DIGITAL SPECIALIST ENGINEER, INFOSYS",
        "descr":"Developed REST API's for Infosys Equinox as a Backend developer and developed marketplace feeds using AWS GLUE.",
        "link":"https://www.infosysequinox.com/"

    },
    {
        "imag":"https://www.analyticsinsight.net/wp-content/uploads/2019/08/Infosys.jpg",
        "desig":"SYSTEM ENGINEER SPECIALIST, INFOSYS",
        "descr":"Design and developed the UI for Infosys Equinox as a Frontend developer, Fixed major UI related issues using react and next.js.",
        "link":"https://www.infosysequinox.com/"

    },{
        "imag":"https://www.analyticsinsight.net/wp-content/uploads/2019/08/Infosys.jpg",
        "desig":"SYSTEM ENGINEER SPECIALIST TRAINEE, INFOSYS",
        "descr":"Designed and developed an ecommerce web application (similar to amazon). Developed UI for cart and orders component using Angular and material UI Developed microservices and REST API's for cart and orders backend for load balancing using node, express and mongodb.",
        "link":"https://www.google.com"

    }
]